import land1 from "@assets/land1.png";
import land2 from "@assets/land2.png";
import land3 from "@assets/land3.png";
import land4 from "@assets/land4.png";
import land5 from "@assets/land5.png";
import land6 from "@assets/land6.png";

export const pics = [land1, land2, land3, land4, land5, land6];

export const features = [
  {
    id: 1,
    head: "Змейки, которых вы любите",
    body: "Для популярных видов\u00a0— королевских питонов, удавов и\u00a0маисовых полозов\u00a0— созданы индивидуальные разделы. Больше никакого хаоса и бесконечных общих списков. Каждый вид требует внимания, поэтому питомцы не свалены в «одну кучу», а эстетично распределены по своим местам",
  },
  {
    id: 2,
    head: "Не «Что? Где? Когда?»",
    body: "Кто. Когда. Сколько. C\u00a0кем\u00a0— без вопросов, только ответы, твёрдо и\u00a0чётко. Подробная статистика веса, кормлений (+ срыги/отказы), линьки, масса и\u00a0тип\u00a0КО в\u00a0форме наглядных таблиц и\u00a0графиков. Календарь кормлений с\u00a0настройкой уведомлений не\u00a0позволит пропустить кого увлеченно кормим сегодня вечером!",
  },
  {
    id: 3,
    head: "Пока не родила",
    body: "Составляйте пэйринги для Бридинг проектов, подсаживайте до\u00a03-х самцов к\u00a0самке, отмейчайте локи, овуляции, предродовые линьки. Контролируйте полученную кладку\u00a0— сроки до\u00a0вылупа, количество яиц и\u00a0итоговое количество малышей",
  },
  {
    id: 4,
    head: "А вы чья мама?",
    body: "Для малышей из\u00a0ваших кладок автоматически ведется родословная. Можно указывать родственные связи вручную, в\u00a0том числе привязать родителей не\u00a0из\u00a0вашей коллекции, например от\u00a0заводчика. Родословная отображается в\u00a0Маркете",
  },
  {
    id: 5,
    head: "А у нас будет что-то типа обэда?",
    body: "Больше не\u00a0придется пересчитывать пакетики с\u00a0КО в\u00a0морозильнике, переведите их\u00a0в\u00a0«цифру» Достаточно один раз указать (и/или позже изменить) сетку диапазонов граммовки и\u00a0количества\u00a0КО, и\u00a0при каждом кормлении будет происходить актуализация наличия",
  },
  {
    id: 6,
    head: "Продаёте? Просто показываем",
    body: "Хоть раз что-то находили через поиск в\u00a0репто-группах VK? Так вот, забудьте об\u00a0этом, как о\u00a0страшном сне. Здесь\u00a0— поиск по\u00a0генетике, городам, полу, цене и\u00a0всему остальному, что может понадобиться",
  },
];

export const subfeatures = ["Калькулятор генетики в свободном режиме и в Бридинг проектах", "Импорт из ваших Товаров VK и husbandry-приложений", "Передать змею со всей статистикой новому владельцу — один клик"];
