export const versionHistory = [
  {
    id: 5,
    ver: "1.2.1",
    date: "09-21-2025",
    list: ["Переосмыслены контекстные меню в таблицах", "При внесении данных по массе, добавлена возможность указывать с/без экскрементов, с последующим отображением на графике", "Добавлен функционал pull-to-refresh"],
  },
  {
    id: 4,
    ver: "1.2.0",
    date: "09-21-2025",
    list: ["Исправлено поведение выпадашек в меню фильтров", "В профиле змеи корректно отображается стоимость", "Добавлена возможность вести трекинг Удавов (пока что без кладок и бридинга"],
  },
  {
    id: 3,
    ver: "1.1.1",
    date: "08-27-2025",
    list: ["Исправлены safe-inset-area в шапках мобильных устройств", "Точечная актуализация UI", "Небольшие правки API"],
  },
  {
    id: 2,
    ver: "1.1.0",
    date: "08-23-2025",
    list: [
      "Добавлена возможность помечать выбранный ген как Pos в выпадашке морфинга. Для этого - кликнуть и удерживать",
      "Исправлена проблема с неверным количеством напоминаний за целевой день",
      "Точечная корректировка UI",
      "Исправлены несколько мелких багов, влияющих на UX",
    ],
  },
  {
    id: 1,
    ver: "1.0.0",
    date: "08-09-2025",
    list: ["Подготовлена MVP-версия для бета-теста, приглашена первая волна пользователей"],
  },
];
