export const versionHistory = [
  {
    id: 11,
    ver: "1.5.0",
    date: "11-04-2025",
    list: ["Добавлен Маркет - возможность просматривать чужие и добавлять свои объявы", "Фикс всяких мелких багов, точечные изменения UI"],
  },
  {
    id: 10,
    ver: "1.4.0",
    date: "10-09-2025",
    list: ["Добавлена возможность вести трекинг Маисов (пока что без кладок и бридинга"],
  },
  {
    id: 9,
    ver: "1.3.2",
    date: "10-08-2025",
    list: ["Добавлена индикация отсутствия напоминания для змеи", "Добавлен футер для будущего наполнения. Пока что - принимаю донаты"],
  },
  {
    id: 8,
    ver: "1.3.1",
    date: "10-06-2025",
    list: ["В результаты калькулятора добавлены названия морф-комб, если таковые имеются для выбранных генов", "Исправлены баги в Бридинге", "Изменён процесс append_feed_snake на бэке"],
  },
  {
    id: 7,
    ver: "1.3.0",
    date: "10-03-2025",
    list: ["Добавлена страница калькуляторов для Питонов, Удавов, Маисов"],
  },
  {
    id: 6,
    ver: "1.2.2",
    date: "10-01-2025",
    list: ["Добавлен функционал редактирования данных для графиков массы Змеи и КО"],
  },
  {
    id: 5,
    ver: "1.2.1",
    date: "09-27-2025",
    list: ["Переосмыслены контекстные меню в таблицах", "При внесении данных по массе, добавлена возможность указывать с/без экскрементов, с последующим отображением на графике", "Добавлен функционал pull-to-refresh"],
  },
  {
    id: 4,
    ver: "1.2.0",
    date: "09-21-2025",
    list: ["Исправлено поведение выпадашек в меню фильтров", "В профиле змеи корректно отображается стоимость", "Добавлена возможность вести трекинг Удавов (пока что без кладок и бридинга"],
  },
  {
    id: 3,
    ver: "1.1.1",
    date: "08-27-2025",
    list: ["Исправлены safe-inset-area в шапках мобильных устройств", "Точечная актуализация UI", "Небольшие правки API"],
  },
  {
    id: 2,
    ver: "1.1.0",
    date: "08-23-2025",
    list: [
      "Добавлена возможность помечать выбранный ген как Pos в выпадашке морфинга. Для этого - кликнуть и удерживать",
      "Исправлена проблема с неверным количеством напоминаний за целевой день",
      "Точечная корректировка UI",
      "Исправлены несколько мелких багов, влияющих на UX",
    ],
  },
  {
    id: 1,
    ver: "1.0.0",
    date: "08-09-2025",
    list: ["Подготовлена MVP-версия для бета-теста, приглашена первая волна пользователей"],
  },
];
