export const versionHistory = [
  {
    id: 3,
    ver: "1.1.1",
    date: "08-25-2025",
    list: ["Исправлены safe-inset-area в шапках мобильных устройств"],
  },
  {
    id: 2,
    ver: "1.1.0",
    date: "08-23-2025",
    list: [
      "Добавлена возможность помечать выбранный ген как Pos в выпадашке морфинга. Для этого - кликнуть и удерживать",
      "Исправлена проблема с неверным количеством напоминаний за целевой день",
      "Точечная корректировка UI",
      "Исправлены несколько мелких багов, влияющих на UX",
    ],
  },
  {
    id: 1,
    ver: "1.0.0",
    date: "08-09-2025",
    list: ["Подготовлена MVP-версия для бета-теста, приглашена первая волна пользователей"],
  },
];
