import { useLayoutEffect } from "preact/hooks";
import { Box, List, Space } from "@mantine/core";

export function Terms() {
  let trg = document.getElementById("layoutsdbr");
  useLayoutEffect(() => {
    let trgH = document.getElementById("layouthdr");
    trg?.classList.add("hide");
    trgH?.classList.add("hide");

    return () => {
      trg?.classList.remove("hide");
      trgH?.classList.remove("hide");
    };
  }, [trg]);

  return (
    <Box>
      <List type="ordered">
        <strong>Политика в отношении обработки информации и идентификаторов пользователей</strong>
        <List.Item>
          Сервис https://snaketrack.ru (Hissstory) (далее – Исполнитель) не осуществляет сбор, хранение или обработку персональных данных в значении Федерального закона №152-ФЗ. Настоящая политика определяет порядок обработки информации и меры по обеспечению
          безопасности информации и идентификаторов.
        </List.Item>
        <List.Item>
          Исполнитель ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке информации и идентификаторов, в том числе защиты прав на неприкосновенность частной жизни, личную и
          семейную тайну.
        </List.Item>
        <List.Item>Настоящая политика Исполнителя в отношении обработки информации и идентификаторов (далее – Политика) применяется ко всей информации, которую Исполнитель может получить о посетителях Веб-сайта https://snaketrack.ru.</List.Item>
      </List>
      <Space h="lg" />
      <List type="ordered">
        <strong>Общие положения о деятельности snaketrack.ru</strong>
        <List.Item>
          Сайт носит сугубо информационный характер и не является публичной офертой, определяемой Статьей 437 (2) ГК РФ. Данный сайт не является аффилированным подразделением, авторизованным партнером или продавцом. <br />
          https://snaketrack.ru - это агрегатор товарных предложений продавцов, работающий по принципу маркетплейс. Сайт https://snaketrack.ru и его администратор не используют в рекламных целях и не заявляют об исключительных правах на отображаемые на сайте
          товарные знаки (при наличии таковых).
        </List.Item>
        <List.Item>
          Все зарегистрированные знаки (при наличии таковых) являются собственностью их правообладателей. https://snaketrack.ru использует их исключительно для идентификации представленных товаров и информирования посетителей об их потребительских свойствах.
          https://snaketrack.ru всегда старается обеспечить максимальную достоверность и полноту информации, но не даёт абсолютной гарантии её достоверности и не несет ответственности за ошибки, несоответствия или неполную информацию, а также за результаты её
          использования без предварительной консультации с владельцами товара.
        </List.Item>
        <List.Item>
          Сайт https://snaketrack.ru является площадкой, где товары размещаются по принципу «маркетплейс», с целью быть связующим звеном между источниками спроса (Покупателями) и предложения (Продавцами). Покупатели и Продавцы сотрудничают между собой на лично
          оговоренных условиях и несут в соответствии с этим ответственность друг перед другом.
        </List.Item>
      </List>
      <Space h="lg" />
      <List type="ordered">
        <strong>Основные понятия, используемые в Политике</strong>
        <List.Item>Пользователь - любой посетитель Веб-сайта https://snaketrack.ru;</List.Item>
        <List.Item>Веб-сайт - совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу https://snaketrack.ru;</List.Item>
        <List.Item>
          Объявление - информационное сообщение Пользователя Веб-сайта, содержащее предложение о Товаре (включая контактную информацию, изображения и любую сопутствующую информацию), размещаемое Пользователем на Веб-сайте, не являющееся публичной офертой и
          адресованное неопределенному кругу лиц.
        </List.Item>
        <List.Item>Товар - любой товар, продукт в отношении которого Пользователь обладает правом владения и размещает на Веб-сайте Объявление.</List.Item>
      </List>
      <Space h="sm" />
      <List type="ordered">
        <strong>Политика обработки идентификаторов пользователей</strong>
        <List.Item>При регистрации Пользователь указывает уникальный идентификатор (далее — «Логин»). Логин может иметь формат адреса электронной почты, однако не рассматривается Веб-сайтом как персональный контактный адрес.</List.Item>
        <List.Item>
          Указанный идентификатор используется исключительно в момент входа для сверки с ранее созданной учётной записью. Веб-сайт не сохраняет идентификатор в открытом виде, не передаёт его третьим лицам и не использует для коммуникации с Пользователем, а
          только лишь для отправки сверочного OTP-кода авторизации.
        </List.Item>
        <List.Item>Почтовый адрес, указанный при регистрации, не рассматривается как персональный контакт, а приравнивается к уникальному псевдониму. Веб-сайт не отправляет не анализирует его и не хранит в читаемом виде.</List.Item>
        <List.Item>В дальнейшем Пользователь имеет право (но не обязан) задать псевдоним, отображаемый другим Пользователям Веб-сайта, в целях дифференциации пользователей и информации об их товарах.</List.Item>
      </List>
      <Space h="lg" />
      <List>
        <strong>Пользовательское соглашение</strong>
        <List.Item>
          Настоящее Пользовательское соглашение регулирует отношения по пользованию Интернет-ресурса с адресом https://snaketrack.ru (именуемом в дальнейшем Веб-сайт) между https://snaketrack.ru (именуемом в дальнейшем «Исполнитель») и юридическим или
          физическим лицом, использующим Веб-сайт в целях поиска, просмотра и/или размещения Объявлений (далее – «Пользователь»).
        </List.Item>
        <List.Item>
          Регистрируясь на Веб-сайте или используя Веб-сайт для поиска/просмотра Объявлений, Пользователь соглашается с настоящим Пользовательским соглашением (далее по тексту «ПС») и принимает на себя указанные в нем права и обязанности, связанные с
          использованием Веб-сайта.
        </List.Item>
        <List.Item>
          <strong>Предмет соглашения</strong>
          <List type="ordered" withPadding>
            <List.Item>Исполнитель предлагает Вам свои услуги на условиях, являющихся предметом настоящего Пользовательского соглашения.</List.Item>
            <List.Item>Пользовательское соглашение может быть изменено Исполнителем без предупреждения. Новая редакция Пользовательского соглашения вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией ПС.</List.Item>
            <List.Item>Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу https://snaketrack.ru/terms и доступна всем пользователям</List.Item>
          </List>
          <strong>Описание услуг</strong>
          <List type="ordered" withPadding>
            <List.Item>
              Веб-сайт является Интернет-площадкой, позволяющей Пользователю самостоятельно на свой страх и риск размещать предложения, адресованные неопределенному кругу лиц в отношении Товара, которым Пользователь правомочен распоряжаться (делать
              предложения), а другим пользователям Веб-сайта принимать или не принимать на свое усмотрение и под свою ответственность предложения, размещенные на Веб-сайте Пользователем, заключать или не заключать соответствующую сделку с Пользователем,
              разместившим Объявление на Веб-сайте. Исполнитель ни в коей мере не может считаться и не является организатором сделки, покупателем, продавцом, посредником, агентом или представителем какого-либо пользователя Веб-сайта и/или иным заинтересованным
              лицом в отношении предлагаемой/заключаемой между пользователями Веб-сайта сделки. Все совершаемые благодаря размещению Пользователем Объявления на Веб-сайте сделки между пользователями Веб-сайта заключаются и исполняются без прямого или
              косвенного участия Исполнителя.
            </List.Item>
            <List.Item>
              Исполнитель не дает Пользователю никаких гарантий того, что любые предложения, сделанные пользователям Веб-сайта посредством размещения Объявления на Веб-сайте, либо с использованием контактной информации, находящейся в Объявлении, будут получены
              и рассмотрены другими пользователями Веб-сайта.
            </List.Item>
            <List.Item>
              Пользователь обязуется соблюдать осмотрительность при выборе контрагента, под свою ответственность принимает решение о сделке, самостоятельно удостоверяясь, что предложение, содержащееся в Объявлении на Веб-сайте, является действительным и
              законным.
            </List.Item>
          </List>
          <strong>Права и обязанности Исполнителя</strong>
          <List type="ordered" withPadding>
            <List.Item>
              Информация, поступившая на Веб-сайт, считается собственностью Исполнителя. Исполнитель не несет никаких обязательств по обеспечению конфиденциальности в отношении этой информации, если не имеется письменной договоренности с Пользователем об
              обратном или соответствующих требований действующего законодательства.
            </List.Item>
            <List.Item>
              Информация, содержащаяся на Веб-сайте, не может быть воспроизведена или использована для публикаций без письменного разрешения Исполнителя, если на странице, содержащей такую информацию, явно не указано обратное. Копирование информации,
              содержащейся на Веб-сайте, может осуществляться только физическими лицами для личного пользования.
            </List.Item>
            <List.Item>Ни при каких обстоятельствах Исполнитель не несет ответственности за ущерб, убытки или расходы, возникшие в связи с использованием Веб-сайта или невозможностью его использования.</List.Item>
            <List.Item>
              Исполнитель вправе в любое время по своему усмотрению проводить выборочную проверку Объявлений на предмет соблюдения Пользователем настоящего ПС, в том числе в автоматическом режиме с использованием программных средств. В случае выявления
              нарушений, в том числе в случае получения жалоб от третьих лиц о таких нарушениях, Исполнитель вправе определять качество объявлений, их соответствие требованиям настоящего ПС и законодательства РФ, приостанавливать или прекращать доступ
              Пользователя к тем или иным сервисам Веб-сайта, включая отклонение или блокирование Объявления и/или доступа Пользователя к личному кабинету без уведомления Пользователя об этом. По решению Исполнителя блокирование Объявлений и/или
              регистрационных данных Пользователя на Веб-сайте может быть временным или постоянным, в зависимости от объема и количества допущенных Пользователем нарушений настоящего Пользовательского соглашения и иных, установленных Исполнителем, правил
              использования Веб-сайта. В случае устранения Пользователем допущенных нарушений, Исполнитель вправе восстановить заблокированное ранее Объявление или доступ Пользователя к личному кабинету.
            </List.Item>
            <List.Item>
              Исполнитель имеет право в одностороннем порядке изменять настоящее ПС и иные документы, регулирующие правила использования Веб-сайта и оказание услуг Веб-сайта. Новая редакция указанных документов вступает в силу с момента ее размещения на
              Веб-сайте, если иное не предусмотрено новой редакцией соответствующего документа.
            </List.Item>
            <List.Item>
              Испольнитель обязуется предоставлять возможность Пользователю размещать Объявления на Веб-сайте, производить поиск Объявлений других пользователей, находящихся в базе Веб-сайта, согласно правилам и ограничениям, установленным Исполнителем на
              данный момент времени.
            </List.Item>
            <List.Item>Испольнитель обязуется предоставлять возможность Пользователю управлять доступом к своему Объявлению и устанавливать иные настройки, доступные для Пользователей в определённый момент времени.</List.Item>
          </List>
          <strong>Обязательства Пользователя при регистрации</strong>
          <br />
          <span>В рамках настоящего Пользовательского соглашения Пользователь обязуется</span>
          <List type="ordered" withPadding>
            <List.Item>Знать и соблюдать Правила публикации Объявлений, которые являются неотъемлемой частью настоящего ПС.</List.Item>
            <List.Item>Не размещать любым способом, посредством Веб-сайта, информацию в нарушение законодательства РФ и международного законодательства.</List.Item>
            <List.Item>Не размещать заведомо недостоверную информацию.</List.Item>
            <List.Item>
              Не размещать и/или передавать, используя Веб-сайт, материалы и/или Товары, в случае, если Пользователь не имеет на это соответствующих прав. Это касается материалов, защищенных авторскими правами, торговыми марками, патентами, а также
              соглашениями о нераспространении информации, конфиденциальности, товаров, для реализации которых необходимо получение соответствующих разрешений, в случае отсутствия таких разрешений и тому подобными.
            </List.Item>
            <List.Item>Не нарушать информационную безопасность Веб-сайта</List.Item>
            <List.Item>Не внедрять исполняемый код на стороне Пользователя, любые внедряемые объекты, использовать frame и iframe, каскадные таблицы стилей, html-код.</List.Item>
            <List.Item>Не вводить в заблуждение других пользователей и администрацию Веб-сайта относительно своей идентификации любым способом.</List.Item>
            <List.Item>Не уничтожать и/или не изменять любые материалы на Сайте, автором которых Пользователь не является.</List.Item>
          </List>
          <strong>Доступ к информации Пользователей</strong>
          <List type="ordered" withPadding>
            <List.Item>
              Вся контактная информация, содержащаяся в размещенных Пользователем Объявлениях на Веб-сайте является общедоступной. Размещая на Сайте Объявления, Пользователь понимает, что размещенная информация публикуется им на Сайте в открытом доступе, то
              есть доступна для ознакомления любому посетителю Сайта (неограниченному кругу лиц), находящемуся в любом месте, с устройства, имеющим выход в сеть Интернет. Соответственно, Пользователь понимает и принимает на себя все риски, связанные с таким
              размещением контактной информации.
            </List.Item>
            <List.Item>
              Доступ Пользователя к изменению информации, содержащейся в Объявлении, производится им только на основе уникальных логина и пароля, выбранных Пользователем при регистрации на Веб-сайте. Ответственность за сохранность пароля несет сам
              Пользователь.
            </List.Item>
            <List.Item>При утере пароля доступа Пользователь имеет возможность сброса пароля через электронную почту, указанную им при регистрации, и возобновить доступ к аккаунту.</List.Item>
            <List.Item>
              Пользователь самостоятельно и добровольно принимает решение о предоставлении своей контактной информации (через Объявление) (а так же любой иной указанной им информации) Исполнителю и другим Пользователям и посетителям Веб-сайта.
            </List.Item>
          </List>
          <strong>Использование материалов Веб-сайта</strong>
          <List type="ordered" withPadding>
            <List.Item>Каждый Пользователь Веб-сайта отвечает за информацию, размещаемую от его имени и за последствия этого размещения.</List.Item>
            <List.Item>
              Веб-сайт носит сугубо информационный характер и не является публичной офертой, определяемой Статьей 437 (2) ГК РФ. Данный сайт не является аффилированным подразделением, авторизованным партнером или продавцом. Веб-сайт является лишь средством для
              передачи информации и Исполнитель ни в коем случае не несет ответственности за ее достоверность и актуальность.
            </List.Item>
            <List.Item>Исполнитель прилагает все возможные усилия для того, чтобы исключить с Веб-сайта небрежную, неаккуратную или заведомо неполную информацию, однако, в конечном счете, ответственность за нее лежит на разместивших ее лицах.</List.Item>
            <List.Item>При перепечатке и ином использовании материалов Веб-сайта ссылка на Веб-сайт обязательна.</List.Item>
            <List.Item>
              В случае, если Пользователь сохраняет объявление или часть информации, содержащейся в Объявлении в своей собственной базе данных вне Веб-сайта, то ответственность за это несет Пользователь в рамках Закона «О персональных данных», как оператор
              персональных данных.
            </List.Item>
            <List.Item>Не допускается использование программных средств (скриптов, роботов) для считывания информации с Веб-сайта</List.Item>
            <List.Item>Логотип, название, элементы дизайна, оформления и общий внешний вид Веб-сайта являются собственностью Исполнителя и их использование запрещено.</List.Item>
          </List>
        </List.Item>
      </List>
      <Space h="lg" />
      <List>
        <strong>Общие положения о подаче объявлений</strong>
        <List.Item>При регистрации на данном сайте Пользователь соглашается с настоящими правилами и принимает на себя указанные в них права и обязанности, связанные с подачей объявлений на сайт.</List.Item>
        <List.Item>Содержание рекламных объявлений не должно противоречить Федеральному закону «О рекламе» № 38-ФЗ от 13.03.2006 г.</List.Item>
        <List.Item>Не размещайте законом запрещенные к публикации товары и услуги.</List.Item>
        <List.Item>Не подавайте одно и то же объявление (о предложении одного и того же товара) повторно, независимо от того, размещаете ли вы их в разных регионах или категориях.</List.Item>
        <List.Item>Размещайте один определенный товар в одном объявлении. Исключение составляет предложение «комплекта», который продается/сдается целиком, с указанием цены за весь комплект.</List.Item>
        <List.Item>Не размещайте объявления общего рекламного характера, объявления о рекламе интернет-ресурсов (порталов, форумов, сайтов знакомств и т.д.), бизнеса (магазинов, компаний).</List.Item>
        <List.Item>Не размещайте объявления с просьбой о материальной помощи, сбору средств на лечение, принятия в дар и пр.</List.Item>
        <List.Item>Не допускаются к публикации объявления, содержащие заведомо ложную информацию, рекламу финансовых «пирамид» и других сомнительных способов получения дохода.</List.Item>
        <List.Item>Если Ваше предложение более не актуально, то обязательно снимайте объявление с публикации после совершения сделки.</List.Item>
        <List.Item>
          Не допускается реклама, в которой отсутствует часть существенной информации о рекламируемом товаре, об условиях его приобретения или использования, если при этом искажается смысл информации и вводятся в заблуждение потребители рекламы.
        </List.Item>
        <List.Item>После размещения (публикации) объявление становится видимым всем пользователям и проверяется модератором. Если модератор обнаружит ошибку, то объявление будет отклонено с обязательным указанием причины отклонения.</List.Item>
      </List>
    </Box>
  );
}
